cs306/week03/wa03.org
#+TITLE: Weekly Assignment 03
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP: showeverything

#+BEGIN_SRC elisp :results silent
  (setq score (- 100 
                 5 ; for failure to write up what you learned
                  0 ; no bonus for 4+ MIs
              ))
  (insert (format "\n#+SCORE: %3.2f\n" score))

#+END_SRC

#+SCORE: 95.00


#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2018-05-19 Sat 14:02]
| Headline                            |    Time |      |
|-------------------------------------+---------+------|
| *Total time*                        | *11:38* |      |
|-------------------------------------+---------+------|
| Exercise 7 on page 149              |    0:23 |      |
| Exercise Converting C to Elisp      |    0:13 |      |
| Exercise 1 on page 166              |    1:06 |      |
| Exercise 12 on page 167             |    1:10 |      |
| Exercise Your Google-Fu             |    0:01 |      |
| Ponder Ten Numbers                  |    6:39 |      |
| \_  Observations:                   |         | 0:48 |
| Ponder Metacognitive Miscalibration |    0:34 |      |
| Notes                               |    1:32 |      |
| \_  Day 1                           |         | 1:32 |
#+END:



Worked with:

James Palmer
Asa Skousen
Matt Wyndham
Jon Manoa
Quade Morrison
Bryan Müller 
Zach Delano
Adam Gehring

* DONE Exercise 7 on page 149
  CLOSED: [2018-05-17 Thu 11:34]
  :LOGBOOK:
  CLOCK: [2018-05-17 Thu 11:11]--[2018-05-17 Thu 11:34] =>  0:23
  :END:

  Write pseudocode for a recursive algorithm for generating all
  \(2^n\) bit strings of length /n/.

#+BEGIN_VERSE 
 *ALGORITHM* /genBitStrings(n, str)/
 /// Recursively finds and prints all bit strings
 /// of length n

 /// Input: Integer /n = A non-negative integer/ 
 /// Input: String /str = An empty string /
 /// Output: Prints a list of strings of size n
 /// each containing one of the possible bitstrings of size n

 *if* /n/ is greater than /0/
      /genBitString(n - 1, str + "0")/
      /genBitString(n - 1, str + "1")/
 *else*
      print /str/
#+END_VERSE

* DONE Exercise Converting C to Elisp
  CLOSED: [2018-05-17 Thu 08:26]
  :LOGBOOK:
  CLOCK: [2018-05-17 Thu 08:13]--[2018-05-17 Thu 08:26] =>  0:13
  :END:

  Convert this C code for doing Russian Peasant Multiplication into
  elisp.

#+BEGIN_SRC C
  #include<stdio.h>

  int main()
  {
     long int a,b,rim;
     long int sum=0;

     printf("ENTER MULTIPLICAND: ");
     scanf("%ld",&b);
     printf("ENTER MULTIPLIER: ");
     scanf("%ld",&a);
     while(b>=1)
     {
        rim=b%2;
        b=b/2;
        if(rim==1)
        {
     sum=sum+a;
     printf("%ld\n", sum);
        }
        a=a*2;
     }
     printf("%ld\n",sum);
     return 0;
  }
#+END_SRC


  Hint:

#+BEGIN_SRC emacs-lisp
  (let ((n (string-to-number (read-from-minibuffer "ENTER NUMBER: "))))
    (* 2 n))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results silent
  (defun russian-peasant ()
     (let ((b (read-number "ENTER MULTIPLICAND: "))
           (a (read-number "ENTER MULTIPLIER: "))
           (sum 0)
           (rim 0))
           (while (>= b 1)
                  (setq rim (mod b 2)
                        b (/ b 2))
                   (if (= rim 1) 
                       (progn (setq sum (+ sum a))
                              (print sum)))
                   (setq a (* a 2)))
           (print sum)))
                        
#+END_SRC

#+BEGIN_SRC emacs-lisp :results output
  (russian-peasant)
#+END_SRC

#+RESULTS:
: 
: 89
: 
: 267
: 
: 623
: 
: 623

