cs306/week03/wa03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-22 Tue 18:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly Assignment 03</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bryan Muller" />
</head>
<body>
<div id="content">
<h1 class="title">Weekly Assignment 03</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2018-05-19 Sat 14:02]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-right">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-right"><b>11:38</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Exercise 7 on page 149</td>
<td class="org-right">0:23</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exercise Converting C to Elisp</td>
<td class="org-right">0:13</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exercise 1 on page 166</td>
<td class="org-right">1:06</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exercise 12 on page 167</td>
<td class="org-right">1:10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Exercise Your Google-Fu</td>
<td class="org-right">0:01</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Ponder Ten Numbers</td>
<td class="org-right">6:39</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;Observations:</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">0:48</td>
</tr>

<tr>
<td class="org-left">Ponder Metacognitive Miscalibration</td>
<td class="org-right">0:34</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Notes</td>
<td class="org-right">1:32</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;Day 1</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">1:32</td>
</tr>
</tbody>
</table>



<p>
Worked with:
</p>

<p>
James Palmer
Asa Skousen
Matt Wyndham
Jon Manoa
Quade Morrison
Bryan Müller 
Zach Delano
Adam Gehring
</p>

<div id="outline-container-org6fabe50" class="outline-2">
<h2 id="org6fabe50"><span class="done DONE">DONE</span> Exercise 7 on page 149</h2>
<div class="outline-text-2" id="text-org6fabe50">
<p>
Write pseudocode for a recursive algorithm for generating all
\(2^n\) bit strings of length <i>n</i>.
</p>

<p class="verse">
<b>ALGORITHM</b> <i>genBitStrings(n, str)</i><br />
<i>/</i> Recursively finds and prints all bit strings<br />
<i>/</i> of length n<br />
<br />
<i>/</i> Input: Integer <i>n = A non-negative integer</i><br />
<i>/</i> Input: String <i>str = An empty string /<br />
//</i> Output: Prints a list of strings of size n<br />
<i>/</i> each containing one of the possible bitstrings of size n<br />
<br />
<b>if</b> <i>n</i> is greater than <i>0</i><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<i>genBitString(n - 1, str + "0")</i><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;<i>genBitString(n - 1, str + "1")</i><br />
<b>else</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;print <i>str</i><br />
</p>
</div>
</div>

<div id="outline-container-org4f6027f" class="outline-2">
<h2 id="org4f6027f"><span class="done DONE">DONE</span> Exercise Converting C to Elisp</h2>
<div class="outline-text-2" id="text-org4f6027f">
<p>
Convert this C code for doing Russian Peasant Multiplication into
elisp.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #bc6ec5;">#include</span><span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">{</span>
   <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">a</span>,<span style="color: #7590db;">b</span>,<span style="color: #7590db;">rim</span>;
   <span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">sum</span>=<span style="color: #a45bad;">0</span>;

   printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"ENTER MULTIPLICAND: "</span><span style="color: #bc6ec5;">)</span>;
   scanf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"%ld"</span>,&amp;b<span style="color: #bc6ec5;">)</span>;
   printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"ENTER MULTIPLIER: "</span><span style="color: #bc6ec5;">)</span>;
   scanf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"%ld"</span>,&amp;a<span style="color: #bc6ec5;">)</span>;
   <span style="color: #4f97d7; font-weight: bold;">while</span><span style="color: #bc6ec5;">(</span>b&gt;=<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span>
   <span style="color: #bc6ec5;">{</span>
      rim=b%<span style="color: #a45bad;">2</span>;
      b=b/<span style="color: #a45bad;">2</span>;
      <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #2d9574;">(</span>rim==<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">{</span>
   sum=sum+a;
   printf<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"%ld\n"</span>, sum<span style="color: #67b11d;">)</span>;
      <span style="color: #2d9574;">}</span>
      a=a*<span style="color: #a45bad;">2</span>;
   <span style="color: #bc6ec5;">}</span>
   printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"%ld\n"</span>,sum<span style="color: #bc6ec5;">)</span>;
   <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>


<p>
Hint:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>n <span style="color: #67b11d;">(</span>string-to-number <span style="color: #b1951d;">(</span>read-from-minibuffer <span style="color: #2d9574;">"ENTER NUMBER: "</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>* <span style="color: #a45bad;">2</span> n<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">russian-peasant</span> <span style="color: #bc6ec5;">()</span>
   <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>b <span style="color: #b1951d;">(</span>read-number <span style="color: #2d9574;">"ENTER MULTIPLICAND: "</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>a <span style="color: #b1951d;">(</span>read-number <span style="color: #2d9574;">"ENTER MULTIPLIER: "</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>sum <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span>
         <span style="color: #67b11d;">(</span>rim <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #67b11d;">(</span>&gt;= b <span style="color: #a45bad;">1</span><span style="color: #67b11d;">)</span>
                <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> rim <span style="color: #b1951d;">(</span>mod b <span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span>
                      b <span style="color: #b1951d;">(</span>/ b <span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
                 <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>= rim <span style="color: #a45bad;">1</span><span style="color: #b1951d;">)</span> 
                     <span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">progn</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> sum <span style="color: #bc6ec5;">(</span>+ sum a<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
                            <span style="color: #4f97d7;">(</span>print sum<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
                 <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> a <span style="color: #b1951d;">(</span>* a <span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span>print sum<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>russian-peasant<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
