cs306/week03/wa03.org
* DONE Exercise 1 on page 166
  CLOSED: [2018-05-17 Thu 15:35]
  :PROPERTIES:
  :ORDERED:  t
  :END:
  :LOGBOOK:
  CLOCK: [2018-05-17 Thu 14:38]--[2018-05-17 Thu 15:35] =>  0:57
  CLOCK: [2018-05-17 Thu 11:35]--[2018-05-17 Thu 11:44] =>  0:09
  :END:

  *a.* If we measure an instance size of computing the greatest common
  divisor of /m/ and /n/ by the size of the second number /n/, by how
  much can the size decrease after one iteration of Euclid's
  algorithm

  *Answer*
  Euclid's GCD algorithm decreases by size m mod n each iteration. 
  The largest number that m mod n can be is n - 1 do to the nature of modular
  arithmetic, so the largest value Euclid's GCD algorithm can decrease 
  in one iteration is n - 1. Therefore, the Euclidean GCD can decrease
  by any integer value between 0 and n - 1.

  *b.* Prove that an instance size will always decrease at least by a
  factor of two after two successive iterations of Euclid's algorithm.

  *Answer*

  Given three iterations of the gcd, a b and c where

  \(GCD(m_1, n_1)\)

  \(GCD(m_2, n_2)\)

  \(GCD(m_3, n_3)\)

  Then m_3 = n_2 = m_1 mod n_1.

  We know that when finding the GCD, m > n. With this knowledge, we can 
  conclude that with this example, \(m_i > p_i\) where \(1 \le i \le 3\)

  To prove that the instance size decreases by a factor of two at least
  every two iterations, we must show that

  \(m_1 \mod n_1 \le \frac{m_1}{2}\)  

  We are now left with two cases. 
  
  Case 1:
    \(n \le \frac{m}{2}\)

  Case 2:
    \(n \gt \frac{m}{2} \)

  Given Case 1, we can determine that

  \((m \mod n) < n \le \frac{m}{2}\)

  Given Case 2, we can determine that

  \((m \mod n) = (m - n) < m - \frac{m}{2}\)

  These two cases guaruntee that every two iterations, the
  instance size will decrease /at least/ by a factor of two.

  Example:

  *Tracing GCD part b*

#+BEGIN_SRC emacs-lisp
  (trace-gcd 34 22)
#+END_SRC


 Where \(r = m \mod n\)


|  m | = |  n | (m/n) | + |  r | m/2 | Case |
|----+---+----+-------+---+----+-----+------|
| 34 | = | 21 | (1)   | + | 13 |  17 |    2 |
| 21 | = | 13 | (1)   | + |  8 |  10 |    2 |
| 13 | = |  8 | (1)   | + |  5 |   6 |    2 |
|  8 | = |  5 | (1)   | + |  3 |   4 |    2 |
|  5 | = |  3 | (1)   | + |  2 |   2 |    2 |
|  3 | = |  2 | (1)   | + |  1 |   1 |    2 |
|  2 | = |  1 | (2)   | + |  0 |   1 |    1 |



* DONE Exercise 12 on page 167
  CLOSED: [2018-05-18 Fri 12:47]
  :LOGBOOK:
  CLOCK: [2018-05-18 Fri 12:20]--[2018-05-18 Fri 12:47] =>  0:27
  CLOCK: [2018-05-17 Thu 17:22]--[2018-05-17 Thu 17:46] =>  0:24
  CLOCK: [2018-05-17 Thu 15:35]--[2018-05-17 Thu 15:54] =>  0:19
  :END:

  /Flipping Pancakes/

  There are /n/ pancakes all of different sizes that are stacked on
  top of each other. You are allowed to slip a flipper under one of
  the pancakes and flip over the whole stack above the flipper. The
  purpose is to arrange pancakes according to their size with the
  biggest at the bottom. (You can see a visualization of this puzzle
  on the /Interactive Mathematics Miscellany and Puzzles/ site [Bog].)
  Design an algorithm for solving this puzzle.

  *Answer*

#+BEGIN_VERSE  
   *ALGORITHM* /pancakeFlip/
   //// Sorts a stack of pancakes placing
   //// the largest pancake on the bottom
   //// and the smalelst on top
   
   //// Input: Integer /n = A non-negative integer, number of pancakes/ 
   //// Input: Array /pancakes = A list of unsorted "pancakes"/
   //// Output: Array of sorted pancakes

   i \leftarrow 0
   *while* /i/ < /n/ *do*
       p \leftarrow index of largest unsorted pancake where index > /i/
       *flip* all the pancakes from /p/ to /n/
       *flip* all the pancakes from /i/ to /n/
#+END_VERSE
  

* DONE Exercise Your Google-Fu
  CLOSED: [2018-05-17 Thu 08:27]
  :LOGBOOK:
  CLOCK: [2018-05-17 Thu 08:26]--[2018-05-17 Thu 08:27] =>  0:01
  :END:

  The only research paper published by a well-known individual was
  devoted to the pancakes flipping problem. Who is that individual?

  Bill Gates

* DONE Ponder Ten Numbers
  CLOSED: [2018-05-19 Sat 14:02]
  :LOGBOOK:
  CLOCK: [2018-05-18 Fri 12:48]--[2018-05-18 Fri 14:20] =>  1:32
  CLOCK: [2018-05-17 Thu 17:47]--[2018-05-17 Thu 18:28] =>  0:41
  CLOCK: [2018-05-16 Wed 12:34]--[2018-05-16 Wed 16:12] =>  3:38
  :END:

  | 8512388977 |
  | 3879812591 |
  | 8496958798 |
  | 6127538570 |
  | 5988858046 |
  | 1153456347 |
  | 4124112452 |
  | 2771040826 |
  | 8847666059 |
  | 2727767664 |

** What is The Question?

   Whatever it is, it was inspired by the [[http://scriptures.lds.org/en/abr/fac_2][Book of Abraham, Facsimile No. 2, explanation of Figure 11]].

   /If the student can find out these numbers, so let it be .../

