cs306/week03/wa03.html

<div id="outline-container-org93844a3" class="outline-2">
<h2 id="org93844a3"><span class="done DONE">DONE</span> Exercise 1 on page 166</h2>
<div class="outline-text-2" id="text-org93844a3">
<p>
<b>a.</b> If we measure an instance size of computing the greatest common
divisor of <i>m</i> and <i>n</i> by the size of the second number <i>n</i>, by how
much can the size decrease after one iteration of Euclid's
algorithm
</p>

<p>
<b>Answer</b>
Euclid's GCD algorithm decreases by size m mod n each iteration. 
The largest number that m mod n can be is n - 1 do to the nature of modular
arithmetic, so the largest value Euclid's GCD algorithm can decrease 
in one iteration is n - 1. Therefore, the Euclidean GCD can decrease
by any integer value between 0 and n - 1.
</p>

<p>
<b>b.</b> Prove that an instance size will always decrease at least by a
factor of two after two successive iterations of Euclid's algorithm.
</p>

<p>
<b>Answer</b>
</p>

<p>
Given three iterations of the gcd, a b and c where
</p>

<p>
\(GCD(m_1, n_1)\)
</p>

<p>
\(GCD(m_2, n_2)\)
</p>

<p>
\(GCD(m_3, n_3)\)
</p>

<p>
Then m<sub>3</sub> = n<sub>2</sub> = m<sub>1</sub> mod n<sub>1</sub>.
</p>

<p>
We know that when finding the GCD, m &gt; n. With this knowledge, we can 
conclude that with this example, \(m_i > p_i\) where \(1 \le i \le 3\)
</p>

<p>
To prove that the instance size decreases by a factor of two at least
every two iterations, we must show that
</p>

<p>
\(m_1 \mod n_1 \le \frac{m_1}{2}\)  
</p>

<p>
We are now left with two cases. 
</p>

<p>
Case 1:
  \(n \le \frac{m}{2}\)
</p>

<p>
Case 2:
  \(n \gt \frac{m}{2} \)
</p>

<p>
Given Case 1, we can determine that
</p>

<p>
\((m \mod n) < n \le \frac{m}{2}\)
</p>

<p>
Given Case 2, we can determine that
</p>

<p>
\((m \mod n) = (m - n) < m - \frac{m}{2}\)
</p>

<p>
These two cases guaruntee that every two iterations, the
instance size will decrease <i>at least</i> by a factor of two.
</p>

<p>
Example:
</p>

<p>
<b>Tracing GCD part b</b>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>trace-gcd <span style="color: #a45bad;">34</span> <span style="color: #a45bad;">22</span><span style="color: #4f97d7;">)</span>
</pre>
</div>


<p>
Where \(r = m \mod n\)
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">m</th>
<th scope="col" class="org-left">=</th>
<th scope="col" class="org-right">n</th>
<th scope="col" class="org-left">(m/n)</th>
<th scope="col" class="org-left">+</th>
<th scope="col" class="org-right">r</th>
<th scope="col" class="org-right">m/2</th>
<th scope="col" class="org-right">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">34</td>
<td class="org-left">=</td>
<td class="org-right">21</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">13</td>
<td class="org-right">17</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">21</td>
<td class="org-left">=</td>
<td class="org-right">13</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">8</td>
<td class="org-right">10</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">=</td>
<td class="org-right">8</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">=</td>
<td class="org-right">5</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">=</td>
<td class="org-right">3</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">2</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">=</td>
<td class="org-right">1</td>
<td class="org-left">(2)</td>
<td class="org-left">+</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-org61db529" class="outline-2">
<h2 id="org61db529"><span class="done DONE">DONE</span> Exercise 12 on page 167</h2>
<div class="outline-text-2" id="text-org61db529">
<p>
<i>Flipping Pancakes</i>
</p>

<p>
There are <i>n</i> pancakes all of different sizes that are stacked on
top of each other. You are allowed to slip a flipper under one of
the pancakes and flip over the whole stack above the flipper. The
purpose is to arrange pancakes according to their size with the
biggest at the bottom. (You can see a visualization of this puzzle
on the <i>Interactive Mathematics Miscellany and Puzzles</i> site [Bog].)
Design an algorithm for solving this puzzle.
</p>

<p>
<b>Answer</b>
</p>

<p class="verse">
<b>ALGORITHM</b> <i>pancakeFlip</i><br />
<i>//</i> Sorts a stack of pancakes placing<br />
<i>//</i> the largest pancake on the bottom<br />
<i>//</i> and the smalelst on top<br />
<br />
<i>//</i> Input: Integer <i>n = A non-negative integer, number of pancakes</i><br />
<i>//</i> Input: Array <i>pancakes = A list of unsorted "pancakes"</i><br />
<i>//</i> Output: Array of sorted pancakes<br />
<br />
i &larr; 0<br />
<b>while</b> <i>i</i> &lt; <i>n</i> <b>do</b><br />
&#xa0;&#xa0;&#xa0;&#xa0;p &larr; index of largest unsorted pancake where index &gt; <i>i</i><br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>flip</b> all the pancakes from <i>p</i> to <i>n</i><br />
&#xa0;&#xa0;&#xa0;&#xa0;<b>flip</b> all the pancakes from <i>i</i> to <i>n</i><br />
</p>
</div>
</div>


<div id="outline-container-orgca5deaa" class="outline-2">
<h2 id="orgca5deaa"><span class="done DONE">DONE</span> Exercise Your Google-Fu</h2>
<div class="outline-text-2" id="text-orgca5deaa">
<p>
The only research paper published by a well-known individual was
devoted to the pancakes flipping problem. Who is that individual?
</p>

<p>
Bill Gates
</p>
</div>
</div>

<div id="outline-container-org5286a13" class="outline-2">
<h2 id="org5286a13"><span class="done DONE">DONE</span> Ponder Ten Numbers</h2>
<div class="outline-text-2" id="text-org5286a13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">8512388977</td>
</tr>

<tr>
<td class="org-right">3879812591</td>
</tr>

<tr>
<td class="org-right">8496958798</td>
</tr>

<tr>
<td class="org-right">6127538570</td>
</tr>

<tr>
<td class="org-right">5988858046</td>
</tr>

<tr>
<td class="org-right">1153456347</td>
</tr>

<tr>
<td class="org-right">4124112452</td>
</tr>

<tr>
<td class="org-right">2771040826</td>
</tr>

<tr>
<td class="org-right">8847666059</td>
</tr>

<tr>
<td class="org-right">2727767664</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org63f628d" class="outline-3">
<h3 id="org63f628d">What is The Question?</h3>
<div class="outline-text-3" id="text-org63f628d">
<p>
Whatever it is, it was inspired by the <a href="http://scriptures.lds.org/en/abr/fac_2">Book of Abraham, Facsimile No. 2, explanation of Figure 11</a>.
</p>

<p>
<i>If the student can find out these numbers, so let it be &#x2026;</i>
</p>
</div>
</div>
