cs306/week03/wa03.org
** Observations:
   :LOGBOOK:
   CLOCK: [2018-05-18 Fri 20:39]--[2018-05-18 Fri 21:27] =>  0:48
   :END:
   
   They do not appear in OEIS.org

   If put into a 10x10 matrix, the row reduced echelon form is 
   the 10x10 identity matrix.

   None of them are Fibonacci numbers.

   The first two numbers are prime.

   |     Number | Prime? |                             Binary | Prime Factorization                     |
   |------------+--------+------------------------------------+-----------------------------------------|
   | 8512388977 | Y      | 0111111011011000001011111101110001 | 8512388977                              |
   | 3879812591 | Y      | 0011100111010000010011110111101111 | 3879812591                              |
   | 8496958798 | N      | 0111111010011101010100110101001110 | 2 * 487 * 1381 * 6317                   |
   | 6127538570 | N      | 0101101101001110101101000110001010 | 2 * 5 * 19 * 1087 * 29669               |
   | 5988858046 | N      | 0101100100111101101011100010111110 | 2 * 1861 * 1609043                      |
   | 1153456347 | N      | 0001000100110000000101100011011011 | 3 * 181 * 2124229                       |
   | 4124112452 | N      | 0011110101110100001111011001000100 | 2 * 2 * 1031028113                      |
   | 2771040826 | N      | 0010100101001010101011101000111010 | 2 * 19 * 72922127                       |
   | 8847666059 | N      | 1000001111010111001010101110001011 | 23 * 384681133                          |
   | 2727767664 | N      | 0010100010100101100110111001110000 | 2 * 2 * 2 * 2 * 3 * 3 * 3 * 3 * 2104759 |

   Sum of numbers = 52629600330 The sum of numbers does not appear on the
   interent according to Google

   52629600330 % 7 = 6
   52629600330 % 11 = 10
   52629600330 % 17 = 16. 

   Our group spent a significant amount of time tryinig to solve this puzzle. We
   tried every avenue of approach we could think of.

   Adding digits, multiplying digits, GCDs, no mathematically
   functions/operations we threw at them seemed to do anything.

   Perhaps they are connected because they are not connected? 
   
   When all is said and down, I have pondered this puzzle for quite a while. I
   feel comfortable with the effort I have put in, despite the fact that I was
   unable to provide what I consider to be an adequate solution.

* DONE Ponder Metacognitive Miscalibration
  CLOSED: [2018-05-18 Fri 20:38]
  :PROPERTIES:
  :ORDERED:  t
  :END:
  :LOGBOOK:
  CLOCK: [2018-05-18 Fri 20:02]--[2018-05-18 Fri 20:36] =>  0:34
  :END:

  Read and think about the ramifications of the article /Prepare Your Mind For
  Learning/ by Smith, Moores and Chang.


  I think this article provides a bit of relief to the previous problems. I thnk
  the last page applies very well to the situation I am in with the previous
  puzzle.

  I have come to the realization that I truly have no idea on how to solve the
  problem. All of the approaches that I normally use to tackle problems like
  these have worked; I have exhausted my toolbox. This has led me to question my
  knowledge.

  Through working with other classmates, I was able to learn some new avenues of
  approach as well as share my own. Even with this collaboration we were unable
  to make any headway on the problem. 

  Perhaps I am on the plateau, although I must confess, this class feels like
  the upward climb. 

  Perhaps the Question is not about the numbers. Perhaps the question is
  something along the lines of "Can you recognize the symptoms of MM in your
  thinking?" If so, my answer is a rounding yes. I am absolutely guilty of
  believing I know more than I actually do. Perhaps this problem was the wake up
  call I needed to reignite my metacognitive abilities.

  
* Notes
  
** Day 1
   :LOGBOOK:
   CLOCK: [2018-05-16 Wed 08:00]--[2018-05-16 Wed 09:32] =>  1:32
   :END:


#+BEGIN_SRC emacs-lisp :results silent
(defun trace-gcd (a b)
(loop with r = 0
      until (zerop b)
      collect (list a '= b (list (/ a b)) ' + (setq r (mod a b)) (/ a 2) (if (<= b (/ a 2)) 1 2))
      do (setq a b b r)))
#+END_SRC


#+BEGIN_SRC emacs-lisp
  (trace-gcd 89 40)
#+END_SRC

#+RESULTS:
| 89 | = | 40 | (2) | + | 9 | 44 | 1 |
| 40 | = |  9 | (4) | + | 4 | 20 | 1 |
|  9 | = |  4 | (2) | + | 1 |  4 | 1 |
|  4 | = |  1 | (4) | + | 0 |  2 | 1 |

| 89 | = | 56 | (1)   | + |      33 |  44 |    2 |
| 56 | = | 33 | (1)   | + |      23 |  28 |    2 |
| 33 | = | 23 | (1)   | + |      10 |  16 |    2 |
| 23 | = | 10 | (2)   | + |       3 |  11 |    1 |
| 10 | = |  3 | (3)   | + |       1 |   5 |    1 |
|  3 | = |  1 | (3)   | + |       0 |   1 |    1 |


number of digits of b times 5 is the upper bound of divisions needed by the gcd.



