cs306/week03/wa03.html

<div id="outline-container-org91a5102" class="outline-3">
<h3 id="org91a5102">Observations:</h3>
<div class="outline-text-3" id="text-org91a5102">
<p>
They do not appear in OEIS.org
</p>

<p>
If put into a 10x10 matrix, the row reduced echelon form is 
the 10x10 identity matrix.
</p>

<p>
None of them are Fibonacci numbers.
</p>

<p>
The first two numbers are prime.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Prime?</th>
<th scope="col" class="org-right">Binary</th>
<th scope="col" class="org-left">Prime Factorization</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">8512388977</td>
<td class="org-left">Y</td>
<td class="org-right">0111111011011000001011111101110001</td>
<td class="org-left">8512388977</td>
</tr>

<tr>
<td class="org-right">3879812591</td>
<td class="org-left">Y</td>
<td class="org-right">0011100111010000010011110111101111</td>
<td class="org-left">3879812591</td>
</tr>

<tr>
<td class="org-right">8496958798</td>
<td class="org-left">N</td>
<td class="org-right">0111111010011101010100110101001110</td>
<td class="org-left">2 * 487 * 1381 * 6317</td>
</tr>

<tr>
<td class="org-right">6127538570</td>
<td class="org-left">N</td>
<td class="org-right">0101101101001110101101000110001010</td>
<td class="org-left">2 * 5 * 19 * 1087 * 29669</td>
</tr>

<tr>
<td class="org-right">5988858046</td>
<td class="org-left">N</td>
<td class="org-right">0101100100111101101011100010111110</td>
<td class="org-left">2 * 1861 * 1609043</td>
</tr>

<tr>
<td class="org-right">1153456347</td>
<td class="org-left">N</td>
<td class="org-right">0001000100110000000101100011011011</td>
<td class="org-left">3 * 181 * 2124229</td>
</tr>

<tr>
<td class="org-right">4124112452</td>
<td class="org-left">N</td>
<td class="org-right">0011110101110100001111011001000100</td>
<td class="org-left">2 * 2 * 1031028113</td>
</tr>

<tr>
<td class="org-right">2771040826</td>
<td class="org-left">N</td>
<td class="org-right">0010100101001010101011101000111010</td>
<td class="org-left">2 * 19 * 72922127</td>
</tr>

<tr>
<td class="org-right">8847666059</td>
<td class="org-left">N</td>
<td class="org-right">1000001111010111001010101110001011</td>
<td class="org-left">23 * 384681133</td>
</tr>

<tr>
<td class="org-right">2727767664</td>
<td class="org-left">N</td>
<td class="org-right">0010100010100101100110111001110000</td>
<td class="org-left">2 * 2 * 2 * 2 * 3 * 3 * 3 * 3 * 2104759</td>
</tr>
</tbody>
</table>

<p>
Sum of numbers = 52629600330 The sum of numbers does not appear on the
interent according to Google
</p>

<p>
52629600330 % 7 = 6
52629600330 % 11 = 10
52629600330 % 17 = 16. 
</p>

<p>
Our group spent a significant amount of time tryinig to solve this puzzle. We
tried every avenue of approach we could think of.
</p>

<p>
Adding digits, multiplying digits, GCDs, no mathematically
functions/operations we threw at them seemed to do anything.
</p>

<p>
Perhaps they are connected because they are not connected? 
</p>

<p>
When all is said and down, I have pondered this puzzle for quite a while. I
feel comfortable with the effort I have put in, despite the fact that I was
unable to provide what I consider to be an adequate solution.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfbc3a2d" class="outline-2">
<h2 id="orgfbc3a2d"><span class="done DONE">DONE</span> Ponder Metacognitive Miscalibration</h2>
<div class="outline-text-2" id="text-orgfbc3a2d">
<p>
Read and think about the ramifications of the article <i>Prepare Your Mind For
Learning</i> by Smith, Moores and Chang.
</p>


<p>
I think this article provides a bit of relief to the previous problems. I thnk
the last page applies very well to the situation I am in with the previous
puzzle.
</p>

<p>
I have come to the realization that I truly have no idea on how to solve the
problem. All of the approaches that I normally use to tackle problems like
these have worked; I have exhausted my toolbox. This has led me to question my
knowledge.
</p>

<p>
Through working with other classmates, I was able to learn some new avenues of
approach as well as share my own. Even with this collaboration we were unable
to make any headway on the problem. 
</p>

<p>
Perhaps I am on the plateau, although I must confess, this class feels like
the upward climb. 
</p>

<p>
Perhaps the Question is not about the numbers. Perhaps the question is
something along the lines of "Can you recognize the symptoms of MM in your
thinking?" If so, my answer is a rounding yes. I am absolutely guilty of
believing I know more than I actually do. Perhaps this problem was the wake up
call I needed to reignite my metacognitive abilities.
</p>
</div>
</div>


<div id="outline-container-org8e832d4" class="outline-2">
<h2 id="org8e832d4">Notes</h2>
<div class="outline-text-2" id="text-org8e832d4">
</div>
<div id="outline-container-org1e9b5e0" class="outline-3">
<h3 id="org1e9b5e0">Day 1</h3>
<div class="outline-text-3" id="text-org1e9b5e0">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">trace-gcd</span> <span style="color: #bc6ec5;">(</span>a b<span style="color: #bc6ec5;">)</span>
<span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">loop</span> with r = <span style="color: #a45bad;">0</span>
      until <span style="color: #2d9574;">(</span>zerop b<span style="color: #2d9574;">)</span>
      collect <span style="color: #2d9574;">(</span>list a '= b <span style="color: #67b11d;">(</span>list <span style="color: #b1951d;">(</span>/ a b<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> ' + <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> r <span style="color: #b1951d;">(</span>mod a b<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>/ a <span style="color: #a45bad;">2</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #b1951d;">(</span>&lt;= b <span style="color: #4f97d7;">(</span>/ a <span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span> <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
      do <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> a b b r<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>trace-gcd <span style="color: #a45bad;">89</span> <span style="color: #a45bad;">40</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">89</td>
<td class="org-left">=</td>
<td class="org-right">56</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">33</td>
<td class="org-right">44</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">56</td>
<td class="org-left">=</td>
<td class="org-right">33</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">23</td>
<td class="org-right">28</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">33</td>
<td class="org-left">=</td>
<td class="org-right">23</td>
<td class="org-left">(1)</td>
<td class="org-left">+</td>
<td class="org-right">10</td>
<td class="org-right">16</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">23</td>
<td class="org-left">=</td>
<td class="org-right">10</td>
<td class="org-left">(2)</td>
<td class="org-left">+</td>
<td class="org-right">3</td>
<td class="org-right">11</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">=</td>
<td class="org-right">3</td>
<td class="org-left">(3)</td>
<td class="org-left">+</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">=</td>
<td class="org-right">1</td>
<td class="org-left">(3)</td>
<td class="org-left">+</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>


<p>
number of digits of b times 5 is the upper bound of divisions needed by the gcd.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bryan Muller</p>
<p class="date">Created: 2018-05-22 Tue 18:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
